#==========================================================================================#
# >>>>> ПОДКЛЮЧЕНИЕ БИБЛИОТЕК И МОДУЛЕЙ <<<<< #
#==========================================================================================#

from django.contrib import admin
from django.urls import path, include

#==========================================================================================#
# >>>>>  ГЛОБАЛЬНЫЕ ССЫЛКИ ДЛЯ РАБОТЫ САЙТА <<<<< #
#==========================================================================================#

urlpatterns = [
    # По пути admin/.
    path('admin/', admin.site.urls),
    # По пустому пути.
    path('', include('users.urls')),
]
