
#==========================================================================================#
# >>>>> ПОДКЛЮЧЕНИЕ БИБЛИОТЕК И МОДУЛЕЙ <<<<< #
#==========================================================================================#

from django.contrib.auth.models import AbstractUser
from django.db import models

#==========================================================================================#
# >>>>> МОДЕЛЬ: ПОЛЬЗОВАТЕЛЬ <<<<< #
#==========================================================================================#

class User(AbstractUser):
    # Создание полей модели пользователя.
    username = models.CharField(max_length=150)
    email = models.CharField(max_length=150, unique=True)
    password = models.CharField(max_length=150)

    # Имя пользователя будет заменяться email.
    USERNAME_FIELD = 'email'

    # Cписок имен полей, которые будут запрашиваться при создании пользователя с помощью createsuperuser.
    REQUIRED_FIELDS = ['username']
